# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config'
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'ffmpeg'
brew 'freetds'
brew 'openssl'
brew 'yarn'
brew 'zsh-completions'

# Development
brew 'php'
brew 'mysql'
brew 'mongodb'
brew 'nginx'
brew 'node'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'eid-be'
cask 'eid-be-viewer'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'java'
cask 'mysqlworkbench'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'tableplus'
cask 'there'
cask 'tor-browser'
cask 'tower2'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
#mas 'Giphy Capture', id: xxx
#mas 'The Unarchiver', id: xxx
